shercliff/baseCase/Fico_epotFoamBuoyant/PETSc_Hypre_BoomerAMG/weakScaling/0/B0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      B0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -2 0 0 -1 0 ];

internalField   uniform ( 0 20 0 );

boundaryField
{
  outlet
  {
    type            zeroGradient;
  }
  inlet
  {
    type            zeroGradient;
  }
  bottom
  {
    type            zeroGradient;
  }
  top
  {
    type            zeroGradient;
  }
  sides
  {
    type            zeroGradient;
  }
}


// ************************************************************************* //
