shercliff/baseCase/Fico_epotFoamBuoyant/PETSc_Hypre_BoomerAMG/weakScaling/0/PotE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      PotE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 2 -3 0 0 -1 0 ];

internalField   uniform 0;

boundaryField
{
  outlet
  {
    type            zeroGradient;
  }
  inlet
  {
    type            zeroGradient;
  }
  bottom
  {
    type            fixedGradient;
    gradient        uniform 0;
  }
  top
  {
    type            fixedGradient;
    gradient           uniform 0;
  }
  sides
  {
    type            fixedGradient;
    gradient           uniform 0;
  }
}


// ************************************************************************* //
